In [1]:
my_sets={1,2,3,4,5}
print(my_sets)

{1, 2, 3, 4, 5}

In [3]:
my_sets.add(6)
print(my_sets)

{1, 2, 3, 4, 5, 6}

In [4]:
my_sets.update([6,7,8])
print(my_sets)

{1, 2, 3, 4, 5, 6, 7, 8}

In [5]:
my_sets.remove(2)
print(my_sets)

{1, 3, 4, 5, 6, 7, 8}

In [7]:
my_sets.discard(0)
print(my_sets)

{1, 3, 4, 5, 6, 7, 8}

In [11]:
a={1,2,3}
b={3,4,5}
print(a|b)
print(a&b)
print(a-b)
print(a ^ b)  # {1, 2, 4, 5}

{1, 2, 3, 4, 5}
{3}
{1, 2}
{1, 2, 4, 5}

In [14]:
a.clear()        # Remove all elements
len(a)           # Length of set

0

In [11]:
import pandas as pd
data={
    'Name':['karan','akul','rahul','rohit'],
    'crn' :[2,3,4,5],
    'marks':[2.3,5,5,6]
}
df=pd.DataFrame(data)
print(df)
df.to_csv("result.csv")
pd.read_csv("result.csv")

    Name  crn  marks
0  karan    2    2.3
1   akul    3    5.0
2  rahul    4    5.0
3  rohit    5    6.0

   Unnamed: 0   Name  crn  marks
0           0  karan    2    2.3
1           1   akul    3    5.0
2           2  rahul    4    5.0
3           3  rohit    5    6.0

In [12]:
df.head()

    Name  crn  marks
0  karan    2    2.3
1   akul    3    5.0
2  rahul    4    5.0
3  rohit    5    6.0

In [13]:
df.tail()

    Name  crn  marks
0  karan    2    2.3
1   akul    3    5.0
2  rahul    4    5.0
3  rohit    5    6.0

In [14]:
df.dtypes

Name      object
crn        int64
marks    float64
dtype: object

In [15]:
df[['marks']]

   marks
0    2.3
1    5.0
2    5.0
3    6.0

In [17]:
df['city']='kangra','solan','rampur','garr'

In [18]:
df

    Name  crn  marks    city
0  karan    2    2.3  kangra
1   akul    3    5.0   solan
2  rahul    4    5.0  rampur
3  rohit    5    6.0    garr

In [26]:
df.insert(loc=2,col='number',value=2,3,4,5)

SyntaxError: positional argument follows keyword argument (1210286526.py, line 1)

In [21]:
df

    Name  crn  marks    city
0  karan    2    2.3  kangra
1   akul    3    5.0   solan
2  rahul    4    5.0  rampur
3  rohit    5    6.0    garr

In [27]:
df.describe()

            crn     marks
count  4.000000  4.000000
mean   3.500000  4.575000
std    1.290994  1.588238
min    2.000000  2.300000
25%    2.750000  4.325000
50%    3.500000  5.000000
75%    4.250000  5.250000
max    5.000000  6.000000